{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              15,
              1
            ],
            "dtype": "float32",
            "filters": 32,
            "kernel_size": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d_1",
            "trainable": true,
            "dtype": "float32",
            "strides": [
              2
            ],
            "pool_size": [
              2
            ],
            "padding": "valid",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1",
            "trainable": true,
            "dtype": "float32",
            "data_format": "channels_last"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 50,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv1d_1/kernel",
          "shape": [
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            192,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            50,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}